Autodesk.Revit.DB.IFCUserDefinedPropertySetType
Since:
2027
An enumerated type listing user-defined property set types.
Since:
2027

Autodesk.Revit.DB.IFCUserDefinedPropertySetType.IFCAttributeSet
The property set is a IFC Attribute set.

Autodesk.Revit.DB.IFCUserDefinedPropertySetType.QuantitySet
The property set is a quantity set.

Autodesk.Revit.DB.IFCUserDefinedPropertySetType.PropertySet
The property set is a property set.